wyniki_50G_article/fio_results_zfs_nocache_nvme/block_size_4096/lab-sec-12/fio_seq_write_article_test_output.txt
seq_write_article_test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_write_article_test: Laying out IO file (1 file / 51200MiB)

seq_write_article_test: (groupid=0, jobs=1): err= 0: pid=41703: Sat Apr 19 19:46:51 2025
  write: IOPS=23.2k, BW=90.8MiB/s (95.2MB/s)(16.0GiB/180001msec); 0 zone resets
    slat (usec): min=3, max=11723, avg=40.59, stdev=50.25
    clat (nsec): min=355, max=131318, avg=1369.67, stdev=684.05
     lat (usec): min=3, max=11729, avg=41.96, stdev=50.53
    clat percentiles (nsec):
     |  1.00th=[  390],  5.00th=[  406], 10.00th=[  434], 20.00th=[  932],
     | 30.00th=[ 1144], 40.00th=[ 1256], 50.00th=[ 1336], 60.00th=[ 1448],
     | 70.00th=[ 1592], 80.00th=[ 1768], 90.00th=[ 2040], 95.00th=[ 2320],
     | 99.00th=[ 3248], 99.50th=[ 3664], 99.90th=[ 7264], 99.95th=[10176],
     | 99.99th=[15936]
   bw (  KiB/s): min=21696, max=805208, per=100.00%, avg=93009.40, stdev=85162.32, samples=359
   iops        : min= 5424, max=201302, avg=23252.36, stdev=21290.58, samples=359
  lat (nsec)   : 500=12.63%, 750=3.69%, 1000=5.57%
  lat (usec)   : 2=67.06%, 4=10.81%, 10=0.19%, 20=0.05%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=5.94%, sys=33.00%, ctx=1119047, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4182225,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=90.8MiB/s (95.2MB/s), 90.8MiB/s-90.8MiB/s (95.2MB/s-95.2MB/s), io=16.0GiB (17.1GB), run=180001-180001msec